In [1]:
import numpy as np
import pandas as pd
from pandas import DataFrame, Series

#replace dataFrame Values from a look up value dataFrame

In [9]:
data = {'id':[1,2,3,4],
        'age':[10,10,3,20],
        'val':[111,None,None,222]}
data_look_up = {'age':[3,10,20,30],
                'value':[333,10,20,30]}

mydf1 = DataFrame(data)
mydf2 = DataFrame(data_look_up)

In [10]:
mydf1

   id  age    val
0   1   10  111.0
1   2   10    NaN
2   3    3    NaN
3   4   20  222.0

In [11]:
mydf2

   age  value
0    3    333
1   10     10
2   20     20
3   30     30

In [12]:
#using dict + zip to create a dictionary

d = dict(zip(mydf2['age'],mydf2['value']))
d

{3: 333, 10: 10, 20: 20, 30: 30}

In [13]:
#using map to replace from the look up
mydf1['val'] = mydf1['val'].fillna(mydf1['age'].map(d))
mydf1

   id  age    val
0   1   10  111.0
1   2   10   10.0
2   3    3  333.0
3   4   20  222.0

In [1]:
#replace using .loc
import pandas as pd
import numpy as np
  
# data
Student = {
    'Name': ['John', 'Jay', 'sachin', 'Geetha', 'Amutha', 'ganesh'],
    'gender': ['male', 'male', 'male', 'female', 'female', 'male'],
    'math score': [50, 100, 70, 80, 75, 40],
    'test preparation': ['none', 'completed', 'none', 'completed',
                         'completed', 'none'],
}
  
# creating a Dataframe object
df = pd.DataFrame(Student)
  
# Applying the condition
df.loc[df["gender"] == "male", "gender"] = 1

In [2]:
df

     Name  gender  math score test preparation
0    John       1          50             none
1     Jay       1         100        completed
2  sachin       1          70             none
3  Geetha  female          80        completed
4  Amutha  female          75        completed
5  ganesh       1          40             none

In [3]:
# replace using numpy.where
student = {
    'Name': ['John', 'Jay', 'sachin', 'Geetha', 'Amutha', 'ganesh'],
    'gender': ['male', 'male', 'male', 'female', 'female', 'male'],
    'math score': [50, 100, 70, 80, 75, 40],
    'test preparation': ['none', 'completed', 'none', 'completed',
                         'completed', 'none'],
}
  
# creating a Dataframe object
df = pd.DataFrame(student)
  
  
# Applying the condition
df["gender"] = np.where(df["gender"] == "female", 0, 1)

In [4]:
df

     Name  gender  math score test preparation
0    John       1          50             none
1     Jay       1         100        completed
2  sachin       1          70             none
3  Geetha       0          80        completed
4  Amutha       0          75        completed
5  ganesh       1          40             none